rheoTool/tutorials/rheoHeatFoam/buoyantCavity/Newtonian/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       7860;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       7900;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       7940;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       8040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8140;
    }
)

// ************************************************************************* //
