rheoTool/tutorials/rheoHeatFoam/buoyantCavity/Newtonian/constant/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      thermoProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            boussinesq;

enableViscousDissipation false;

rhoCp           rhoCp [ 1 -1 -2 -1 0 0 0 ] 1.;
beta            beta [0 0 0 -1 0 0 0] 2.414e5;
TRef            TRef [0 0 0 1 0 0 0] 0;

kappaCoeffs
{
    a0              1.;
    a1              0;
    a2              0;
    a3              0;
}

// ************************************************************************* //
