rheoTool/tutorials/rheoHeatFoam/buoyantCavity/Newtonian/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 8 0)
    (0 8 0)
    
    (0 0 1)
    (1 0 1)
    (1 8 1)
    (0 8 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 100 1) simpleGrading
    (
        (
            (0.5 0.5 4)    
            (0.5 0.5 0.25)   
        )
        (
            (0.5 0.5 4)    
            (0.5 0.5 0.25)   
        )
        1               
    )
);

edges
(
);

boundary
(
    down
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    
    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
           (0 1 2 3)
           (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
